<a href="https://colab.research.google.com/github/dishankkalra23/Playing-with-csv-and-pandas/blob/main/Playing_with_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Importing Libraries

In [56]:
import pandas as pd
import numpy as np

## Setting up Kaggle API

In [2]:
 ! pip install -q kaggle

## Uplading kaggle.json file which have API token

In [ ]:
from google.colab import files
files.upload()

In [4]:
# Move the downloaded file to a location ~/.kaggle/kaggle.json.
! mkdir ~/.kaggle
! cp kaggle.json ~/.kaggle/

# You need to give proper permissions to the file (since this is a hidden folder
! chmod 600 ~/.kaggle/kaggle.json

## Copy API command from respective Kaggle dataset

In [5]:
! kaggle datasets download -d spscientist/students-performance-in-exams

Downloading students-performance-in-exams.zip to /content
  0% 0.00/8.70k [00:00<?, ?B/s]
100% 8.70k/8.70k [00:00<00:00, 17.1MB/s]

## Unzipping dataset file and removing zip file

In [6]:
!unzip \*.zip

Archive:  students-performance-in-exams.zip
  inflating: StudentsPerformance.csv

In [7]:
! rm *.zip

# Loading dataset (Gathering Data)

## Reading CSV file

In [8]:
dataset = '/content/StudentsPerformance.csv'
data = pd.read_csv(dataset)
data

     gender race/ethnicity  ... reading score writing score
0    female        group B  ...            72            74
1    female        group C  ...            90            88
2    female        group B  ...            95            93
3      male        group A  ...            57            44
4      male        group C  ...            78            75
..      ...            ...  ...           ...           ...
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[1000 rows x 8 columns]

### CSV stands for comma separated values - but they can actually be separated by different characters, tabs, white space, etc. If your file is separated by a colon, let's say, you can still use read_csv() with the sep parameter.

In [9]:
data_1 = pd.read_csv(dataset,sep=':')

'''
Note: This obviously didn't work because CSV file is separated by commas and seperators we used colon
Because there are no colons, nothing was separated and everything was read into one column
'''
data_1

    gender,"race/ethnicity","parental level of education","lunch","test preparation course","math score","reading score","writing score"
0    female,"group B","bachelor's degree","standard...
1    female,"group C","some college","standard","co...
2    female,"group B","master's degree","standard",...
3    male,"group A","associate's degree","free/redu...
4    male,"group C","some college","standard","none...
..                                                 ...
995  female,"group E","master's degree","standard",...
996  male,"group C","high school","free/reduced","n...
997  female,"group C","high school","free/reduced",...
998  female,"group D","some college","standard","co...
999  female,"group D","some college","free/reduced"...

[1000 rows x 1 columns]

### We can specify which line of the file is the header, which specifies the column labels. It's usually the first line, but sometimes we'll want to specify a later line if there is extra meta information at the top of the file. We can do that like this.

In [10]:
df = pd.read_csv(dataset, header=1)
'''
Here, row 2 was used as the the header and everything above that was cut off. 
By default, read_csv uses header=0, which uses the first line for column labels.
'''
df.head()

   female  group B   bachelor's degree      standard       none  72  72.1  74
0  female  group C        some college      standard  completed  69    90  88
1  female  group B     master's degree      standard       none  90    95  93
2    male  group A  associate's degree  free/reduced       none  47    57  44
3    male  group C        some college      standard       none  76    78  75
4  female  group B  associate's degree      standard       none  71    83  78

### If columns labels are not included in your file, you can use header=None to prevent your first line of data from being misinterpreted as column labels.

In [11]:
df = pd.read_csv(dataset, header=None)
df.head()

        0               1  ...              6              7
0  gender  race/ethnicity  ...  reading score  writing score
1  female         group B  ...             72             74
2  female         group C  ...             90             88
3  female         group B  ...             95             93
4    male         group A  ...             57             44

[5 rows x 8 columns]

In [12]:
labels = ['gen', 'ethn', 'LOE', 'lun', 'test', 'math_Score', 'reading_Score', 'writing_Score']
df = pd.read_csv(dataset, names=labels)
df.head()

      gen            ethn  ...  reading_Score  writing_Score
0  gender  race/ethnicity  ...  reading score  writing score
1  female         group B  ...             72             74
2  female         group C  ...             90             88
3  female         group B  ...             95             93
4    male         group A  ...             57             44

[5 rows x 8 columns]

### In above if you want to tell pandas that there was a header line that you are replacing, you can specify the row of that line like this

In [13]:
labels = ['gen', 'ethn', 'LOE', 'lun', 'test', 'math_Score', 'reading_Score', 'writing_Score']
df = pd.read_csv(dataset, names=labels,header=0)
df.head()

# Note: Replacing 0th index with given labels

      gen     ethn  ... reading_Score writing_Score
0  female  group B  ...            72            74
1  female  group C  ...            90            88
2  female  group B  ...            95            93
3    male  group A  ...            57            44
4    male  group C  ...            78            75

[5 rows x 8 columns]

# Assessing and Building Intuition

In [17]:
df = pd.read_csv(dataset)
df.head()

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93
3    male        group A  ...            57            44
4    male        group C  ...            78            75

[5 rows x 8 columns]

In [19]:
# this returns a tuple of the dimensions of the dataframe
df.shape

(1000, 8)

In [20]:
# this returns the datatypes of the columns
df.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [26]:
# although the datatype for 'parental level of education'  appears to be object, further
# investigation shows it's a string
type(df['parental level of education'][0])

str

## Note: Pandas actually stores [pointers](https://en.wikipedia.org/wiki/Pointer_(computer_programming) to strings in dataframes and series, which is why object instead of str appears as the datatype.

In [27]:
# this displays a concise summary of the dataframe,
# including the number of non-null values in each column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [28]:
# this returns the number of unique values in each column
df.nunique()

gender                          2
race/ethnicity                  5
parental level of education     6
lunch                           2
test preparation course         2
math score                     81
reading score                  72
writing score                  77
dtype: int64

In [29]:
# this returns useful descriptive statistics for each column of data
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [32]:
# `.tail()` returns the first few rows
df.head(10)

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93
3    male        group A  ...            57            44
4    male        group C  ...            78            75
5  female        group B  ...            83            78
6  female        group B  ...            95            92
7    male        group B  ...            43            39
8    male        group D  ...            64            67
9  female        group B  ...            60            50

[10 rows x 8 columns]

In [31]:
# `.tail()` returns the last few rows
df.tail(10)

     gender race/ethnicity  ... reading score writing score
990    male        group E  ...            81            75
991  female        group B  ...            82            78
992  female        group D  ...            76            76
993  female        group D  ...            72            74
994    male        group A  ...            63            62
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[10 rows x 8 columns]

In [38]:
for count,colm in enumerate(df.columns):
  print(count,colm)

0 gender
1 race/ethnicity
2 parental level of education
3 lunch
4 test preparation course
5 math score
6 reading score
7 writing score

In [34]:
df.loc[:,'gender':'parental level of education'].head()

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [37]:
df.iloc[:,:3].head()

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

# Indexing and Selecting Data in Pandas

In [50]:
# Let's separate this dataframe into two new dataframes - 
# parental level of education and scores which have gender and race in common

In [54]:
df_PLOE_ = df.iloc[:,:3]
df_PLOE_.head()

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

## Selecting Multiple Ranges in Pandas

### Selecting columns gender,race with 3 score columns. Use this [stackoverflow link](https://stackoverflow.com/questions/41256648/select-multiple-ranges-of-columns-in-pandas-dataframe) to learn how to select multiple ranges in Pandas

In [63]:
# Using np.r_ to slice the columns of dataframe

df_scores = df.iloc[:,np.r_[:2,5:7]]
df_scores.head()

   gender race/ethnicity  math score  reading score
0  female        group B          72             72
1  female        group C          69             90
2  female        group B          90             95
3    male        group A          47             57
4    male        group C          76             78